#
# Brewfile
# revision 1, 2024-07-15
#

# documentation: https://homebrew-file.readthedocs.io/en/latest/usage.html


#
# General
#

tap "homebrew/cask"

cask_args appdir: "~/Applications", require_sha: true


#
# Regular formulae
#

brew "imagemagick"


#
# Casks
#

cask "1password@7"

cask "ableton-live-suite@11"

cask "acorn"

cask "alfred"

cask "audacity"

cask "brave-browser"

cask "carbon-copy-cloner"

# cask "chromium"
# Ungoogled Chromium
cask "eloston-chromium"

cask "firefox"

cask "font-ibm-plex"

cask "gpg-suite-no-mail"

cask "imageoptim"

cask "libreoffice"

cask "little-snitch@5"

cask "mediathekview"

cask "micro-snitch"

cask "moneymoney"

cask "native-access"

cask "omnifocus"

cask "piezo"

cask "protonmail-bridge"

# cask "protonmail-import-export" # deprecated

cask "teamviewer"

cask "vlc"
