#
# Brewfile
# revision 1
#



#
# Brew Formulae
#

brew 'erlang'

brew 'ffmpeg'

brew 'git'

brew 'mariadb'

brew 'node'

brew 'opus'

brew 'php'

brew 'postgresql'

brew 'python'

brew 'ruby'

brew 'wget'

brew 'youtube-dl'



#
# Brew Cask
#

# cask configuration
cask_args appdir: '/Applications'

# cask setup
tap 'caskroom/cask'


cask 'alfred'

cask 'emacs'

cask 'firefox'

cask 'google-chrome'

cask 'gpg-suite-no-mail'

cask 'handbrake'

cask 'moneymoney'

cask 'omnifocus'

cask 'opera'

cask 'teamviewer'

cask 'textmate'

cask 'visual-studio-code'

cask 'vivaldi'

cask 'vlc'
